{
    "name": "Josh Finnie",
    "contact": {
        "phone": {
            "mobile": 8607165996,
            "business": 2025560346
        },
        "home address": "3900 14th St NW #402 Washington DC 20011",
        "email": "josh@jfin.us",
        "website": "http://www.joshfinnie.com",
        "socialMedia": {
            "twitter": "https://twitter.com/joshfinnie",
            "linkedIn": "linkedin.com/in/joshfinnie"
        }
    },
    "objective": {
        "text": ""
    },
    "skills": [
        {
            "name": "JavaScript",
            "description": "jquery, coffeescript, knockout, backbone, JSON, XML"
        },
        {
            "name": "HTML5",
            "description": "canvas, websockets, workers, video, so much fun html5 stuff!"
        },
        {
            "name": "CSS3",
            "description": "less, Sizzle, and bootstrap makes it easy to look pretty"
        },
        {
            "name": "Node.js",
            "description": "very excited and eager to work more with Node.js"
        },
        {
            "name": "Ruby on Rails",
            "description": "actively learning and getting more engaged with gems and rubies"
        },
        {
            "name": "visualization",
            "description": "jqueryUI, d3js, nvd3.js, wijimo, raphael, and cytoscape represents the data the right way"
        },
        {
            "name": "Mobile Web Development",
            "description": "android, iOS, jquery Mobile"
        },
        {
            "name": "Google",
            "description": "google earth api, google map v3 api, google closure"
        },
        {
            "name": "PHP",
            "description": "been there done that, want to move on."
        },
        {
            "name": "JAVA",
            "description": "haven't touched this in a few years but I remember it to be fun!  also played with JSF, JSPs, Servlets and Maven during the same time"
        },
        {
            "name": "DB",
            "description": "mongoDB, SOLR, traditional oracle sql db's, and played a little with Hadoop"
        },
        {
            "name": "VCS",
            "description": "proficient with Git and SVN"
        },
        {
            "name": "Windows",
            "description": "who doesn't know how to use a windows box?"
        },
        {
            "name": "Apple",
            "description": "have owned almost every type of mac's for the past 10+ years"
        },
        {
            "name": "Linux",
            "description": "the terminal is so much fun"
        },
        {
            "name": "Adobe Creative Suite",
            "description": "I own the Master Collection 3 and 6, big adobe fan boy."
        },
        {
            "name": "3D",
            "description": "Maya, 3D Studio Max, and goolge sketchup.  It's fun to see things in 3d on the screen."
        }
    ],
    "professional_experience": [
        {
            "company": "Koansys, LLC",
            "location": "Arlington, VA",
            "title": "Application Developer",
            "dates": {
                "start": "11/8/2010",
                "end": "present"
            },
            "link": "http://koansys.com/",
            "description": "",
            "projects": [
                {
                    "team": "DEEP Visualization",
                    "dates": "2/2013 - Present",
                    "tools": "Open Calais, SOLR, Javascript, Synapse 3.2, DEEP, GVF, Twitter Storm",
                    "brief": "Utilizing the DEEP client side framework that ingests Twitter Strom data into a locally hosted and configured SOLR instance to pull out OpenCalais metadata which is mapped into a Synapse CDM mapper and inserted into the Synapse framework to be used with OWF Synapse enabled widgets.  Working closely with the GVF team to generate graphical representations of the twitter storm data to help visualize trends and relationships."
                },
                {
                    "team": "Aucto-Re",
                    "dates": "10/2012 - 2/2013",
                    "tools": "Android, Javascript, HTML5, CSS",
                    "brief": "Contributed on a small team to provide many small features and functionality in an augmented reality (virtual models, facial detection, targeting and targets) by with streaming video and metadata information from a mobile device to a remote browser.  Utilized many of the native tools available on the mobile device (compass, gps, accelerometer, heading, and camera) to help generate and automate logic and calculations."
                },
                {
                    "team": "Business Development",
                    "dates": "10/2012 - 12/2012",
                    "tools": "Google Earth, Google Maps, Wijimo, Javascript, HTML5, CSS",
                    "brief": "Worked closely with a team of engineers and business developers on very short deadlines to produce technical prototypes and demo's that simulated mission critical solutions.  Designed and developed numerous client side widgets to reenact a mission and how technology could be utilized to generate visualizations based on specific logic and trends to be rendered in real time."
                },
                {
                    "team": "Synapse Core",
                    "dates": "8/2012 - 10/2012",
                    "tools": "Google Closure, JAVA, Javascript, HTML",
                    "brief": "Developed integration and unit tests to help identify bugs in a rapidly evolving framework.  Helped migrate code from JAVA to Javascript to build out the client side framework.  Wrote convenience functions to enable widget developers to preform CRUD operations on the synapse framework easier."
                },
                {
                    "team": "Graph Visualization Framework",
                    "dates": "4/2011 - 7/2011",
                    "tools": "Cytoscape, Neo4J, ExtJS, JAVA, XML",
                    "brief": "Contributed part time on this startup effort on a graph visualization widget to display big data stored in a Neo4J database on the Cytoscape platform.  Used ExtJs to create panels to display metadata information along with being able to manipulate or filter the display."
                },
                {
                    "team": "OWF Touch",
                    "dates": "2/2011 - 8/2012",
                    "tools": "jQuery Mobile, Android, iOS, Javascript, HTML5, CSS, PMRPC",
                    "brief": "Contributed on a small agile team to develop a framework and the GUI for Synapse/Ozone widgets to interact with tablets, phones, and large format touch displays.  Worked with calculating multi touch gestures and engineered a PUB/SUB messaging interface for widget to widget and widget to framework communication."
                },
                {
                    "team": "Synapse 2.0",
                    "dates": "11/2010 - 2/2011",
                    "tools": "JAVA, Javascript, HTML5, CSS, Log4J, jQuery, ExtJS",
                    "brief": "Worked on a small agile team and maintained Synapse 2.0 widgets.  SES Enabled many of the client side only widgets and provided SES support as well."
                }
            ]
        },
        {
            "company": "Tyco Electronics",
            "location": "Harrisburg, PA",
            "title": "Senior Engineering Systems Analyst",
            "dates": {
                "start": "5/4/2009",
                "end": "11/5/2010"
            },
            "link": "http://www.te.com/",
            "description": "Global Engineering Systems",
            "projects": [
                {
                    "team": "Rotation 3 - Compliance",
                    "dates": "2/2010 - 11/2010",
                    "tools": "PlumTree Portal, JSF, Javascript, HTML5, CSS, jQuery, JAVA",
                    "brief": "Developed a new portlet in the existing PlumTree Portal with JSF that would display search results from customized stored procedures integrated from several databases.  Integrated the new portlet with several other existing portlets for maximum cohesion in the dashboard.  Upon early and successful completion of the first task I was tasked to develop a second JSF application to display the Bill of Material information on specific Parts and all of it's related components.  Developed a custom hierarchal treetable plugin with jQuery, built in session control for user saved preferences based on role and access, and utilized JAVA's POI class to process an offline batch of results greater than 500 rows that would be sent to an email queue to be sent off to the logged in user when the report was ready."
                },
                {
                    "team": "Rotation 2 - Document Management Technologies",
                    "dates": "8/2009 - 1/2010",
                    "tools": "Apache Struts, Javascript, HTML5, CSS, jQuery, datatables",
                    "brief": "Generated the business requirements document, functional design document, technical design document, and use cases necessary to replace a legacy application to manage relationships of items in a parts database to the items in the documents database.  Provided mockups and proof of concepts upon acceptance of each stage and lastly developed the final application in Struts with use of jQuery and DataTables to render the visualization in the Product Lifecycle Management Portal.  Provided the ability to view existing relationships, create new relationships between the various parts and documents, delete and modify existing relationships.  Had built in validation, roll back/recovery, verification screens, and automated reporting for business and system administrators."
                },
                {
                    "team": "Rotation 1 - Core Technical Services",
                    "dates": "5/2009 - 8/2009",
                    "tools": "Borne Shell Script, Javascript, HTML5, CSS, JSF",
                    "brief": "Generated the business requirements document, function design document and use cases necessary to successfully developed a shell scrip that maintained the log files generated by all of the application servers in each of the different zones and environments owned by the Global Engineering Systems team.  Upon early completion and acceptance of task I created a JSF application to read master log files generated on each server to notify designated administrators of irregular activities or warnings identified by the log files."
                }
            ]
        },
        {
            "company": "United States Steel",
            "location": "Pittsburgh, PA",
            "title": "Software Engineer",
            "dates": {
                "start": "5/14/2007",
                "end": "5/1/2009"
            },
            "link": "http://www.uss.com/",
            "description": "Business Intelligence Developer",
            "projects": [
                {
                    "team": "SOA Governance Team",
                    "dates": "8/2008-5/2009",
                    "tools": "OAGIS BODs, Javascript, HTML5, CSS",
                    "brief": "Worked on mapping all of the databases to an OAGIS BOD and documented the BODs in XML.  Implemented HP's Systinet with USSteel's SOA standards and helped setup software to monitor these services and applications."
                },
                {
                    "team": "Architecture Team",
                    "dates": "5/2007-5/2009",
                    "tools": "JAVA, AJAX, SQL, JavaBeans, JSTL, JSP, XML, C#, .NET, WebSphere, ClearCase, Oracle, RAD7, Javascript, HTML5, CSS",
                    "brief": "Maintained existing java applications and helped build functionality for a new security access framework.  Manually maintained several databases with specific requests and helped develop froms to help automate redundant tasks to update databases."
                }
            ]
        },
        {
            "company": "University of Pittsburgh",
            "location": "Pittsburgh, PA",
            "title": "Graduate Student Researcher",
            "dates": {
                "start": "9/14/2006",
                "end": "12/12/2008"
            },
            "link": "http://www.pitt.com/",
            "description": "Visual Information Systems Center",
            "projects": [
                {
                    "team": "Lead Researcher",
                    "dates": "9/2006 - 12/2008",
                    "tools": "MAYA, Adobe Master Collection CS3, AVID",
                    "brief": "Built a 3D model of a nuclear power plant and created an interactive serious game that simulated a tour through the power plant with the Unreal game engine"
                }
            ]
        }
    ],
    "education": [
        {
            "school": "Central Connecticut State University",
            "degree": "Masters of Arts",
            "track": "Geography (Focus in GIS)",
            "dates": {
                "start": "8/2009",
                "end": "12/2009"
            }
        },
        {
            "school": "University of Connecticut",
            "degree": "Bachelor of Arts",
            "track": "Economics (Minor in Mathematics)",
            "dates": {
                "start": "8/2006",
                "end": "5/2008"
            }
        }
    ],
    "hobbies": {
        "sports": [
            {
                "sport": "tennis",
                "years": 16,
                "awards": "USTA Teams 2nd Place 2009"
            },
            {
                "sport": "ultimate frisbee",
                "years": 10,
                "awards": "on Pitt's mens ultimate team for 1 year and actively play recreational league each season"
            },
            {
                "sport": "skiing",
                "years": 18,
                "awards": "best wipeout ever"
            }
        ],
        "creative": [
            {
                "category": "video editing",
                "years": 7,
                "brief": "I enjoyed photography so much, I went into video editing and production, I did a number of small projects with weddings, commercial advertisements, and fundraising videos.",
                "software": "Adobe After Effect, Adobe Premiere, Final Cut Pro, Avid Media Composer"
            },
            {
                "category": "photography",
                "years": 9,
                "brief": "I enjoyed the art of photography and wanted to tell a story by showing the world what I saw through my SLR cameras",
                "tools": [
                    "Canon EOS ti300",
                    "Canon EOS 20d",
                    "Canon EOS 40d",
                    "Canon EOS 5d"
                ],
                "software": "Adobe Lightroom, Adobe Photoshop"
            },
            {
                "category": "audio editing",
                "years": 7,
                "brief": "I was an event dj and provided custom mixes and audio recording to low budget artists building demo reels"
            }
        ],
        "misc": "other hobbies include the passion to fly, stamp collecting, coin collecting, carpentry, traveling, motorcycling and road biking."
    },
    "current professional references" : [
        {
            "name" : "Eli Fajardo",
            "number" : 7039270480,
            "company": "Sotera Defense Solutions",
            "title": Team Lead
        }, {
            "name" : "Justin Grant",
            "number" : 2489747998,
            "company": "Sotera Defense Solutions",
            "title": Senior Software Developer
        }, {
            "name" : "Rick Sutcliffe",
            "number" : 9788705989, ,
            "company": "Sotera Defense Solutions",
            "title": Senior Software Developer
        }
    ]
}
